phoenix-rtos/phoenix-rtos-devices/storage/imxrt-flash/flashsrv.c
	fID = msg->oid.id;
	if (fID >= FLASH_MEMORIES_NO) {
		msg->o.err = -EINVAL;
		return;
	}

	switch (idevctl->type) {
		case flashsrv_devctl_properties:
			TRACE("imxrt-flashsrv: flashsrv_devctl_properties, id: %u, port: %u.", msg->oid.id, msg->oid.port);
			odevctl->properties.size = memory->ctx.properties.size;
			odevctl->properties.psize = memory->ctx.properties.page_size;
			odevctl->properties.ssize = memory->ctx.properties.sector_size;
			odevctl->properties.offs = 0;
			msg->o.err = EOK;
			break;

		case flashsrv_devctl_sync:
			TRACE("imxrt-flashsrv: flashsrv_devctl_sync, id: %u, port: %u.", msg->oid.id, msg->oid.port);
			msg->o.err = flash_sync(&memory->ctx);
			break;

		case flashsrv_devctl_eraseSector:
			TRACE("imxrt-flashsrv: flashsrv_devctl_eraseSector - addr: %u, id: %u, port: %u.", idevctl->erase.addr, msg->oid.id, msg->oid.port);
			if (idevctl->erase.addr >= memory->ctx.properties.size) {
				msg->o.err = -EINVAL;
				break;
			}
			flashsrv_eraseSector(memory->fOid.id, idevctl->erase.addr);
			msg->o.err = EOK;
			break;

		case flashsrv_devctl_erasePartition:
			TRACE("imxrt-flashsrv: flashsrv_devctl_eraseChip, id: %u, port: %u.", msg->oid.id, msg->oid.port);
			flashsrv_chipErase(memory->fOid.id);
			msg->o.err = EOK;
			break;

		case flashsrv_devctl_directWrite:
			TRACE("imxrt-flashsrv: flashsrv_devctl_directWrite, addr: %u, size: %u, id: %u, port: %u.",
				idevctl->write.addr, msg->i.size, msg->oid.id, msg->oid.port);

			if (idevctl->write.addr >= memory->ctx.properties.size) {
				msg->o.err = -EINVAL;
				break;
			}

			msg->o.err = flashsrv_directWrite(memory->fOid.id, idevctl->write.addr, msg->i.data, msg->i.size);
			break;

		case flashsrv_devctl_directRead:
			TRACE("imxrt-flashsrv: flashsrv_devctl_directRead, addr: %u, size: %u, id: %u, port: %u.",
				idevctl->read.addr, msg->o.size, msg->oid.id, msg->oid.port);

			if (idevctl->read.addr >= memory->ctx.properties.size) {
				msg->o.err = -EINVAL;
				break;
			}

			msg->o.err = flashsrv_directRead(memory->fOid.id, idevctl->read.addr, msg->o.data, msg->o.size);
			break;

		case flashsrv_devctl_calcCrc32:
			TRACE("imxrt-flashsrv: flashsrv_devctl_calcCrc32, addr: %u, len: %u, base: %4x, id: %u, port: %u.",
				idevctl->crc32.addr, idevctl->crc32.len, idevctl->crc32.base, msg->oid.id, msg->oid.port);

			if (idevctl->crc32.addr == 0 && idevctl->crc32.len == 0) {
				/* calculate CRC for whole flash */
				idevctl->crc32.len = memory->ctx.properties.size;
			}
			else if ((idevctl->crc32.addr + idevctl->crc32.len) > memory->ctx.properties.size) {
				msg->o.err = -EINVAL;
				break;
			}

			crc32 = idevctl->crc32.base;
			msg->o.err = flashsrv_calcCrc32(memory->fOid.id, idevctl->crc32.addr, idevctl->crc32.len, &crc32);
			odevctl->crc32 = crc32;
			break;

		default:
			msg->o.err = -EINVAL;
			break;
	}
}


static void flashsrv_rawCtl(flashsrv_memory_t *memory, msg_t *msg)
{
	int i;
	uint32_t sNb;
	uint8_t partID;
	uint32_t crc32;
	flash_i_devctl_t *idevctl = (flash_i_devctl_t *)msg->i.raw;
	flash_o_devctl_t *odevctl = (flash_o_devctl_t *)msg->o.raw;

	if (memory == NULL) {
		msg->o.err = -EINVAL;
		return;
	}

	partID = msg->oid.id;
	if (partID >= memory->pCnt) {
		msg->o.err = -EINVAL;
		return;
	}

	if (memory->parts[partID].pStatus == flashsrv_memory_inactive) {
		msg->o.err = -ENODEV;
		return;
	}

	switch (idevctl->type) {
		case flashsrv_devctl_properties:
			TRACE("imxrt-flashsrv: flashsrv_devctl_properties, id: %u, port: %u.", partID, msg->oid.port);
			odevctl->properties.size = memory->parts[partID].pHeader->size;
			odevctl->properties.psize = memory->ctx.properties.page_size;
			odevctl->properties.ssize = memory->ctx.properties.sector_size;
			odevctl->properties.offs = memory->parts[partID].pHeader->offset;
			msg->o.err = EOK;
			break;

		case flashsrv_devctl_sync:
			TRACE("imxrt-flashsrv: flashsrv_devctl_sync, id: %u, port: %u.", msg->oid.id, msg->oid.port);
			msg->o.err = flash_sync(&memory->ctx);
			break;

		case flashsrv_devctl_eraseSector:
			TRACE("imxrt-flashsrv: flashsrv_devctl_eraseSector - addr: %u, id: %u, port: %u.",
				idevctl->erase.addr + memory->parts[partID].pHeader->offset, partID, msg->oid.port);

			if (idevctl->erase.addr >= memory->parts[msg->oid.id].pHeader->size) {
				msg->o.err = -EINVAL;
				break;
			}

			flashsrv_eraseSector(memory->fOid.id, memory->parts[partID].pHeader->offset + idevctl->erase.addr);
			msg->o.err = EOK;
			break;

		case flashsrv_devctl_erasePartition:
			TRACE("imxrt-flashsrv: flashsrv_devctl_erasePartition, id: %u, port: %u.", msg->oid.id, msg->oid.port);
			sNb = memory->parts[partID].pHeader->size / memory->ctx.properties.sector_size;

			for (i = 0; i < sNb; ++i) {
				flashsrv_eraseSector(memory->fOid.id, memory->parts[partID].pHeader->offset + i * memory->ctx.properties.sector_size);
			}

			msg->o.err = EOK;
			break;

		case flashsrv_devctl_directWrite:
			TRACE("imxrt-flashsrv: flashsrv_devctl_directWrite, addr: %u, size: %u, id: %u, port: %u.",
				idevctl->write.addr + memory->parts[partID].pHeader->offset, msg->i.size, msg->oid.id, msg->oid.port);

			if (idevctl->write.addr >= memory->parts[msg->oid.id].pHeader->size) {
				msg->o.err = -EINVAL;
				break;
			}

			msg->o.err = flashsrv_directWrite(memory->fOid.id, memory->parts[partID].pHeader->offset + idevctl->write.addr, msg->i.data, msg->i.size);
			break;

		case flashsrv_devctl_directRead:
			TRACE("imxrt-flashsrv: flashsrv_devctl_directRead, addr: %u, size: %u, id: %u, port: %u.",
				idevctl->read.addr + memory->parts[partID].pHeader->offset, msg->o.size, msg->oid.id, msg->oid.port);

			if (idevctl->read.addr >= memory->parts[msg->oid.id].pHeader->size) {
				msg->o.err = -EINVAL;
				break;
			}

			msg->o.err = flashsrv_directRead(memory->fOid.id, memory->parts[partID].pHeader->offset + idevctl->read.addr, msg->o.data, msg->o.size);
			break;

		case flashsrv_devctl_calcCrc32:
			TRACE("imxrt-flashsrv: flashsrv_devctl_calcCrc32, addr: %u, len: %u, base: %4x, id: %u, port: %u.",
				idevctl->crc32.addr, idevctl->crc32.len, idevctl->crc32.base, msg->oid.id, msg->oid.port);

			if (idevctl->crc32.addr == 0 && idevctl->crc32.len == 0) {
				/* calculate CRC for whole partition */
				idevctl->crc32.len = memory->parts[partID].pHeader->size;
			}
			else if ((idevctl->crc32.addr + idevctl->crc32.len) > memory->parts[partID].pHeader->size) {
				msg->o.err = -EINVAL;
				break;
			}

			crc32 = idevctl->crc32.base;
			msg->o.err = flashsrv_calcCrc32(memory->fOid.id, memory->parts[partID].pHeader->offset + idevctl->crc32.addr, idevctl->crc32.len, &crc32);
			odevctl->crc32 = crc32;
			break;

		default:
			msg->o.err = -EINVAL;
			break;
	}
}


