phoenix-rtos/phoenix-rtos-devices/storage/imxrt-flash/flashsrv.c
/* Threads */

static void flashsrv_meterfsThread(void *arg)
{
	msg_t msg;
	msg_rid_t rid;

	flashsrv_partition_t *part = (flashsrv_partition_t *)arg;

	meterfs_i_devctl_t *idevctl = (meterfs_i_devctl_t *)msg.i.raw;
	meterfs_o_devctl_t *odevctl = (meterfs_o_devctl_t *)msg.o.raw;

	for (;;) {
		if (msgRecv(part->oid.port, &msg, &rid) < 0) {
			continue;
		}

		mutexLock(flashsrv_common.flash_memories[part->fID].lock);

		switch (msg.type) {
			case mtRead:
				msg.o.err = meterfs_readFile(msg.oid.id, msg.i.io.offs, msg.o.data, msg.o.size, (meterfs_ctx_t *)part->fsCtx);
				break;

			case mtWrite:
				msg.o.err = meterfs_writeFile(msg.oid.id, msg.i.data, msg.i.size, (meterfs_ctx_t *)part->fsCtx);
				break;

			case mtLookup:
				msg.o.err = meterfs_lookup(msg.i.data, &msg.o.lookup.fil.id, (meterfs_ctx_t *)part->fsCtx);
				msg.o.lookup.fil.port = part->oid.port;
				memcpy(&msg.o.lookup.dev, &msg.o.lookup.fil, sizeof(oid_t));
				break;

			case mtOpen:
				msg.o.err = meterfs_open(msg.oid.id, (meterfs_ctx_t *)part->fsCtx);
				break;

			case mtClose:
				msg.o.err = meterfs_close(msg.oid.id, (meterfs_ctx_t *)part->fsCtx);
				break;

			case mtDevCtl:
				msg.o.err = meterfs_devctl(idevctl, odevctl, (meterfs_ctx_t *)part->fsCtx);
				break;

			default:
				msg.o.err = -ENOSYS;
				break;
		}

		mutexUnlock(flashsrv_common.flash_memories[part->fID].lock);

		msgRespond(part->oid.port, &msg, rid);
	}
}


static int flashsrv_verifyRawIO(const flashsrv_memory_t *memory, msg_t *msg, size_t *size)
{
	if (memory->parts[msg->oid.id].pStatus == flashsrv_memory_inactive) {
		msg->o.err = -ENODEV;
		return -ENODEV;
	}

	if (memory->parts[msg->oid.id].pHeader->size <= msg->i.io.offs) {
		msg->o.err = -EINVAL;
		return -EINVAL;
	}

	if (memory->parts[msg->oid.id].pHeader->size < (msg->i.io.offs + *size)) {
		*size = memory->parts[msg->oid.id].pHeader->size - msg->i.io.offs;
	}

	return EOK;
}


static void flashsrv_rawThread(void *arg)
{
	int res;
	msg_t msg;
	msg_rid_t rid;
	uint32_t beginAddr;

	flashsrv_memory_t *memory = (flashsrv_memory_t *)arg;

	for (;;) {
		if (msgRecv(memory->rawPort, &msg, &rid) < 0) {
			continue;
		}

		mutexLock(memory->lock);

		if (msg.oid.id >= memory->pCnt) {
			msg.o.err = -EINVAL;
		}
		else if (!hasAccess(&memory->parts[msg.oid.id], msg.pid)) {
			msg.o.err = -EACCES;
		}
		else {
			switch (msg.type) {
				case mtRead:
					res = flashsrv_verifyRawIO(memory, &msg, &msg.o.size);
					if (res == EOK) {
						beginAddr = memory->parts[msg.oid.id].pHeader->offset;
						msg.o.err = flashsrv_bufferedRead(memory->fOid.id, beginAddr + msg.i.io.offs, msg.o.data, msg.o.size);
					}
					else {
						msg.o.err = res;
					}
					break;

				case mtWrite:
					res = flashsrv_verifyRawIO(memory, &msg, &msg.i.size);
					if (res == EOK) {
						beginAddr = memory->parts[msg.oid.id].pHeader->offset;
						msg.o.err = flashsrv_bufferedWrite(memory->fOid.id, beginAddr + msg.i.io.offs, msg.i.data, msg.i.size);
					}
					else {
						msg.o.err = res;
					}
					break;

				case mtDevCtl:
					flashsrv_rawCtl(memory, &msg);
					break;

				case mtOpen:
					/* Exclusive access mechanism enabled on O_EXCL except when O_CREAT is passed */
					if ((msg.i.openclose.flags & (O_CREAT | O_EXCL)) == O_EXCL) {
						memory->parts[msg.oid.id].authProcPid = msg.pid;
					}
					msg.o.err = 0;
					break;

				case mtClose:
					memory->parts[msg.oid.id].authProcPid = 0;
					(void)flashsrv_bufferedSync(memory->fOid.id);
					msg.o.err = 0;
					break;

				case mtSync:
					msg.o.err = flashsrv_bufferedSync(memory->fOid.id);
					break;

				case mtGetAttr:
					if (msg.i.attr.type == atSize) {
						msg.o.attr.val = memory->parts[msg.oid.id].pHeader->size;
						msg.o.err = 0;
					}
					else {
						msg.o.err = -ENOSYS;
					}
					break;

				default:
					msg.o.err = -ENOSYS;
					break;
			}
		}

		mutexUnlock(memory->lock);

		msgRespond(memory->rawPort, &msg, rid);
	}
}


static void flashsrv_devThread(void *arg)
{
	msg_t msg;
	msg_rid_t rid;

	flashsrv_memory_t *memory = (flashsrv_memory_t *)arg;

	for (;;) {
		if (msgRecv(memory->fOid.port, &msg, &rid) < 0) {
			continue;
		}

		mutexLock(memory->lock);
		switch (msg.type) {
			case mtRead:
				msg.o.err = flashsrv_bufferedRead(memory->fOid.id, msg.i.io.offs, msg.o.data, msg.o.size);
				break;

			case mtWrite:
				msg.o.err = flashsrv_bufferedWrite(memory->fOid.id, msg.i.io.offs, msg.i.data, msg.i.size);
				break;

			case mtDevCtl:
				flashsrv_devCtl(memory, &msg);
				break;

			case mtOpen:
			case mtClose:
				msg.o.err = 0;
				break;

			case mtSync:
				msg.o.err = flashsrv_bufferedSync(memory->fOid.id);
				break;

			case mtGetAttr:
				if (msg.i.attr.type == atSize) {
					msg.o.attr.val = memory->ctx.properties.size;
					msg.o.err = 0;
				}
				else {
					msg.o.err = -ENOSYS;
				}
				break;

			default:
				msg.o.err = -ENOSYS;
				break;
		}

		mutexUnlock(memory->lock);

		msgRespond(memory->fOid.port, &msg, rid);
	}
}


/* Initialization functions */

static int flashsrv_initMeterfs(flashsrv_partition_t *part)
{
	meterfs_ctx_t *ctx;

	part->fsCtx = calloc(1, sizeof(meterfs_ctx_t));
	if (part->fsCtx == NULL) {
		LOG_ERROR("imxrt-flashsrv: cannot allocate memory.");
		return -ENOMEM;
	}

	ctx = (meterfs_ctx_t *)part->fsCtx;

	ctx->sz = part->pHeader->size;
	ctx->offset = part->pHeader->offset;
	ctx->sectorsz = flashsrv_common.flash_memories[part->fID].ctx.properties.sector_size;

	if (part->fID == 0) {
		ctx->read = flashsrv_fsReadf0;
		ctx->write = flashsrv_fsWritef0;
		ctx->eraseSector = flashsrv_fsEraseSectorf0;
	}
	else if (part->fID == 1) {
		ctx->read = flashsrv_fsReadf1;
		ctx->write = flashsrv_fsWritef1;
		ctx->eraseSector = flashsrv_fsEraseSectorf1;
	}

	ctx->keyInit = false;

	if (meterfs_init(ctx) < 0) {
		LOG_ERROR("imxrt-flashsrv: init meterfs at flash: %u, partition: %u.", part->fID, part->oid.id);
		return -1;
	}

	return EOK;
}


static int flashsrv_mountPart(flashsrv_partition_t *part)
{
	void *mem;
	int res = EOK;
	char path[32];

	snprintf(path, sizeof(path), "/dev/flash%u.%s", part->fID, part->pHeader->name);

	switch (part->pHeader->type) {
		/* Raw partitions locate within single flash chip are handled by one thread */
		case ptable_raw:
			part->fsCtx = NULL;
			part->oid.port = flashsrv_common.flash_memories[part->fID].rawPort;

